sprayMASCOTTELAM/0/alphat
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       volScalarField;
    location    "0";
    object      alphat;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -1 0 0 0 0];

internalField   uniform 0.00001755;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 28.8e-08;
    }

    outlet
    {
        type            zeroGradient;
    }

    bottom1
    {
        type            compressible::alphatWallFunction;
        value           uniform 0;

    }

    bottom2
    {
        type            compressible::alphatWallFunction;
        value           uniform 0;

    }

    top1
    {
        type            compressible::alphatWallFunction;
        value           uniform 0;

    }

    top2
    {
        type            compressible::alphatWallFunction;
        value           uniform 0;

    }


}


// ************************************************************************* //
