sprayMASCOTTELAM/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 3.898e-07;

boundaryField
{
    inlet
    {
        type            fixedValue;
        Value           uniform 6.29e-08
    }
    outlet
    {
        type            zeroGradient;
    }
    bottom1
    {
        type            nutkWallFunction;
        value           uniform 0;

    }
    bottom2
    {
        type            nutkWallFunction;
        value           uniform 0;

    }
    top1
    {
        type            nutkWallFunction;
        value           uniform 0;

    }
    top2
    {
        type            nutkWallFunction;
        value           uniform 0;

    }

    walls
    {
        type            nutkWallFunction;
        value           uniform 0;
    }
}


// ************************************************************************* //
