sprayMASCOTTELAM/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// ************************************************************************* //

dimensions          [1 -1 -2 0 0 0 0];

internalField       uniform 3.97e+06;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 3.97e+06;
    }

    outlet
    {
        type            zeroGradient;
    }

    bottom1
    {
        type            noSlip;
    }

    bottom2
    {
        type            noSlip;
    }

    top1
    {
        type            noSlip;
    }

    top2
    {
        type            noSlip;
    }

}

// ************************************************************************* //
