sprayMASCOTTELAM/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.001;

vertices
(
    (0 -3 -0.05)          //0
    (5.5 -1.1 -0.05)      //1
    (95.5 -1.1 -0.05)     //2
    (95.5 -61 -0.05)      //3
    (895.5 -61 -0.05)     //4
    (895 -1.1 -0.05)      //5
    (0 3 -0.05)           //6
    (5.5 1.1 -0.05)       //7
    (95.5 1.1 -0.05)      //8
    (895.5 1.1 -0.05)     //9 
    (95.5 61 -0.05)       //10
    (895.5 61 -0.05)      //11
    (0 -3 0.05)           //12
    (5.5 -1.1 0.05)       //13
    (95.5 -1.1 0.05)      //14
    (95.5 -61 0.05)       //15
    (895.5 -61 0.05)      //16
    (895 -1.1 0.05)       //17
    (0 3 0.05)            //18
    (5.5 1.1 0.05)        //19
    (95.5 1.1 0.05)       //20
    (895.5 1.1 0.05)      //21
    (95.5 61 0.05)        //22
    (895.5 61 0.05)       //23
    
);

blocks
(
    hex (0 1 7 6 12 13 19 18) (6 2 1) simpleGrading (1 1 1)
    hex (1 2 8 7 13 14 20 19) (30 2 1) simpleGrading (1 1 1)
    hex (2 3 4 5 14 15 16 17) (100 100 1) simpleGrading (1 1 1) 
    hex (2 5 9 8 14 17 21 20) (100 2 1) simpleGrading (1 1 1) 
    hex (8 9 11 10 20 21 23 22) (100 100 1) simpleGrading (1 1 1) 
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 12 18 6)
        );
    }

    
    outlet
    {
        type patch;
        faces
        (
            (4 5 17 16)
            (5 9 21 17)
            (9 11 23 21)
        );
    }
    bottom1
    {
        type wall;
        faces
        (
            (0 1 13 12)
            (1 2 14 13)
        );
    }
    bottom2
    {
        type wall;
        faces
        (
            (2 3 15 14)
            (3 4 16 15)
        );
    }

    top1
    {
        type wall;
        faces
        (
            (6 18 19 7)
            (7 19 20 8)
        );
    }
    top2
    {
        type wall;
        faces
        (
            (8 20 22 10)
            (10 22 23 11)
        );
    }

      
);

mergePatchPairs
(
);

// ************************************************************************* //
